reports/033-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.093ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.086ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  585.74us  59.46ms   72.72%
    Req/Sec     3.52k   221.88     6.22k    76.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.45ms
 90.000%    1.74ms
 99.000%    2.13ms
 99.900%    2.66ms
 99.990%   10.14ms
 99.999%   52.38ms
100.000%   59.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            1         1.00
       0.419     0.100000        50173         1.11
       0.582     0.200000       100158         1.25
       0.737     0.300000       150135         1.43
       0.892     0.400000       199781         1.67
       1.051     0.500000       249980         2.00
       1.128     0.550000       274726         2.22
       1.208     0.600000       299703         2.50
       1.289     0.650000       324703         2.86
       1.369     0.700000       349830         3.33
       1.451     0.750000       374624         4.00
       1.493     0.775000       387157         4.44
       1.535     0.800000       399559         5.00
       1.579     0.825000       412137         5.71
       1.626     0.850000       424679         6.67
       1.677     0.875000       437070         8.00
       1.705     0.887500       443229         8.89
       1.735     0.900000       449544        10.00
       1.767     0.912500       455733        11.43
       1.802     0.925000       462041        13.33
       1.841     0.937500       468296        16.00
       1.862     0.943750       471346        17.78
       1.885     0.950000       474513        20.00
       1.910     0.956250       477661        22.86
       1.936     0.962500       480746        26.67
       1.965     0.968750       483828        32.00
       1.981     0.971875       485385        35.56
       1.998     0.975000       486906        40.00
       2.018     0.978125       488530        45.71
       2.038     0.981250       490046        53.33
       2.063     0.984375       491622        64.00
       2.079     0.985938       492449        71.11
       2.095     0.987500       493157        80.00
       2.115     0.989062       493943        91.43
       2.137     0.990625       494726       106.67
       2.163     0.992188       495510       128.00
       2.179     0.992969       495882       142.22
       2.199     0.993750       496303       160.00
       2.219     0.994531       496674       182.86
       2.247     0.995313       497078       213.33
       2.281     0.996094       497440       256.00
       2.301     0.996484       497636       284.44
       2.327     0.996875       497832       320.00
       2.359     0.997266       498032       365.71
       2.403     0.997656       498221       426.67
       2.457     0.998047       498420       512.00
       2.487     0.998242       498515       568.89
       2.525     0.998437       498622       640.00
       2.561     0.998633       498708       731.43
       2.611     0.998828       498806       853.33
       2.667     0.999023       498905      1024.00
       2.701     0.999121       498952      1137.78
       2.739     0.999219       499001      1280.00
       2.785     0.999316       499051      1462.86
       2.829     0.999414       499099      1706.67
       2.989     0.999512       499147      2048.00
       3.457     0.999561       499171      2275.56
       4.015     0.999609       499195      2560.00
       4.679     0.999658       499220      2925.71
       5.251     0.999707       499244      3413.33
       5.743     0.999756       499269      4096.00
       6.231     0.999780       499281      4551.11
       6.619     0.999805       499293      5120.00
       7.191     0.999829       499305      5851.43
       7.719     0.999854       499317      6826.67
       8.623     0.999878       499330      8192.00
       9.503     0.999890       499336      9102.22
      10.367     0.999902       499342     10240.00
      10.895     0.999915       499348     11702.86
      11.831     0.999927       499354     13653.33
      13.063     0.999939       499360     16384.00
      16.959     0.999945       499363     18204.44
      20.911     0.999951       499366     20480.00
      26.607     0.999957       499369     23405.71
      30.607     0.999963       499372     27306.67
      36.351     0.999969       499375     32768.00
      39.551     0.999973       499377     36408.89
      40.287     0.999976       499378     40960.00
      43.487     0.999979       499380     46811.43
      45.983     0.999982       499381     54613.33
      49.151     0.999985       499383     65536.00
      49.983     0.999986       499384     72817.78
      49.983     0.999988       499384     81920.00
      52.383     0.999989       499385     93622.86
      53.215     0.999991       499386    109226.67
      55.615     0.999992       499387    131072.00
      55.615     0.999993       499387    145635.56
      55.615     0.999994       499387    163840.00
      56.287     0.999995       499388    187245.71
      56.287     0.999995       499388    218453.33
      58.623     0.999996       499389    262144.00
      58.623     0.999997       499389    291271.11
      58.623     0.999997       499389    327680.00
      58.623     0.999997       499389    374491.43
      58.623     0.999998       499389    436906.67
      59.487     0.999998       499390    524288.00
      59.487     1.000000       499390          inf
#[Mean    =        1.072, StdDeviation   =        0.586]
#[Max     =       59.456, Total count    =       499390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599690 requests in 1.00m, 77.78MB read
Requests/sec:   9994.82
Transfer/sec:      1.30MB