reports/033-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.168ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.168ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.156ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms    4.57ms 100.93ms   99.24%
    Req/Sec     3.50k   724.47    27.56k    98.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.57ms
 90.000%    1.92ms
 99.000%    2.65ms
 99.900%   78.46ms
 99.990%   96.83ms
 99.999%   99.65ms
100.000%  100.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.079     0.000000            1         1.00
       0.507     0.100000        50014         1.11
       0.677     0.200000       100009         1.25
       0.826     0.300000       149918         1.43
       0.977     0.400000       199947         1.67
       1.137     0.500000       249887         2.00
       1.218     0.550000       274877         2.22
       1.301     0.600000       299825         2.50
       1.386     0.650000       324621         2.86
       1.477     0.700000       349686         3.33
       1.570     0.750000       374569         4.00
       1.619     0.775000       387134         4.44
       1.669     0.800000       399633         5.00
       1.722     0.825000       412015         5.71
       1.780     0.850000       424624         6.67
       1.844     0.875000       437045         8.00
       1.879     0.887500       443324         8.89
       1.917     0.900000       449574        10.00
       1.959     0.912500       455748        11.43
       2.005     0.925000       462013        13.33
       2.055     0.937500       468296        16.00
       2.083     0.943750       471481        17.78
       2.111     0.950000       474485        20.00
       2.143     0.956250       477593        22.86
       2.179     0.962500       480743        26.67
       2.221     0.968750       483927        32.00
       2.243     0.971875       485385        35.56
       2.271     0.975000       486940        40.00
       2.303     0.978125       488539        45.71
       2.345     0.981250       490028        53.33
       2.411     0.984375       491597        64.00
       2.455     0.985938       492370        71.11
       2.513     0.987500       493164        80.00
       2.593     0.989062       493938        91.43
       2.719     0.990625       494720       106.67
       4.535     0.992188       495490       128.00
      11.303     0.992969       495879       142.22
      19.535     0.993750       496270       160.00
      27.663     0.994531       496659       182.86
      36.095     0.995313       497050       213.33
      44.447     0.996094       497440       256.00
      48.543     0.996484       497635       284.44
      52.991     0.996875       497830       320.00
      57.151     0.997266       498025       365.71
      61.567     0.997656       498220       426.67
      65.727     0.998047       498416       512.00
      68.159     0.998242       498520       568.89
      70.527     0.998437       498610       640.00
      72.959     0.998633       498708       731.43
      75.775     0.998828       498806       853.33
      78.847     0.999023       498903      1024.00
      80.191     0.999121       498952      1137.78
      82.495     0.999219       499001      1280.00
      84.863     0.999316       499050      1462.86
      86.655     0.999414       499100      1706.67
      88.575     0.999512       499148      2048.00
      89.727     0.999561       499171      2275.56
      90.879     0.999609       499197      2560.00
      91.711     0.999658       499220      2925.71
      92.991     0.999707       499245      3413.33
      93.887     0.999756       499270      4096.00
      94.463     0.999780       499281      4551.11
      95.103     0.999805       499295      5120.00
      95.359     0.999829       499305      5851.43
      96.255     0.999854       499317      6826.67
      96.639     0.999878       499331      8192.00
      96.767     0.999890       499338      9102.22
      97.087     0.999902       499342     10240.00
      97.663     0.999915       499349     11702.86
      97.855     0.999927       499354     13653.33
      98.047     0.999939       499362     16384.00
      98.111     0.999945       499364     18204.44
      98.175     0.999951       499366     20480.00
      98.431     0.999957       499370     23405.71
      98.559     0.999963       499372     27306.67
      99.327     0.999969       499376     32768.00
      99.391     0.999973       499377     36408.89
      99.455     0.999976       499378     40960.00
      99.519     0.999979       499381     46811.43
      99.519     0.999982       499381     54613.33
      99.647     0.999985       499386     65536.00
      99.647     0.999986       499386     72817.78
      99.647     0.999988       499386     81920.00
      99.647     0.999989       499386     93622.86
      99.647     0.999991       499386    109226.67
      99.967     0.999992       499387    131072.00
      99.967     0.999993       499387    145635.56
      99.967     0.999994       499387    163840.00
     100.927     0.999995       499388    187245.71
     100.927     0.999995       499388    218453.33
     100.991     0.999996       499390    262144.00
     100.991     1.000000       499390          inf
#[Mean    =        1.519, StdDeviation   =        4.568]
#[Max     =      100.928, Total count    =       499390]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599690 requests in 1.00m, 67.49MB read
Requests/sec:   9994.79
Transfer/sec:      1.12MB